var str = prompt('Введите свое имя')
console.log('Меня зовут ' + (str));

var str2 = prompt('сколько вам лет?')
console.log('Мне ' + (str2) + ' лет');

 var str3 = prompt('Решите пример 23 + 12')
 console.log('Пример 1: 23 + 12 Правильный ответ: 35 Ваш ответ: ' + (str3));

 var str4 = prompt('Решите пример 163 - 43')
 console.log('Пример 2: 163 - 43 Правильный ответ: 120 Ваш ответ: ' + (str4));

 var str5 = prompt('Решите пример 12 * 9')
 console.log('Пример 3: 12 * 9 Правильный ответ: 108 Ваш ответ: ' + (str5));

 var str6 = prompt('Решите пример 33 + 66')
 console.log('Пример 4: 66 / 33 Правильный ответ: 2 Ваш ответ: ' + (str6));

 var str7 = prompt('Решите пример 50 % 234')
 console.log('Пример 5: 50 % 234 Правильный ответ: 117 Ваш ответ: ' + (str7));

 var str3 = prompt('Откройте консоль просмотра')